In [1]:
import pandas as pd

In [4]:
sales = pd.read_excel("sales.xls", index_col=0)

In [5]:
sales

            City Country  Sales  Bonus
Mike    New York     USA     25   2.50
Jim       Boston     USA     43   4.30
Steven    London      UK     76   7.60
Joe       Madrid   Spain     12   1.80
Tom        Paris  France     89  13.35

In [6]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Mike to Tom
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   City     5 non-null      object
 1   Country  5 non-null      object
 2   Sales    5 non-null      int64
 3   Bonus    5 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 200.0+ bytes

In [9]:
pd.read_excel('sales.xls', index_col=0, header = 0)

            City Country  Sales  Bonus
Mike    New York     USA     25   2.50
Jim       Boston     USA     43   4.30
Steven    London      UK     76   7.60
Joe       Madrid   Spain     12   1.80
Tom        Paris  France     89  13.35

In [14]:
pd.read_excel('sales.xls', index_col = 0, names = ['name', 'city', 'nation', 'revn', 'adtl_comp'])

            city  nation  revn  adtl_comp
name
Mike    New York     USA    25       2.50
Jim       Boston     USA    43       4.30
Steven    London      UK    76       7.60
Joe       Madrid   Spain    12       1.80
Tom        Paris  France    89      13.35